package MVC_folderFormat.view;

import java.util.Scanner;

// View : 게시물 관련 입출력

public class View {
    // 싱글톤 선언 =======================================

    // Controller 싱글톤 호출  =======================================

    // 0. 여러 메소드에서 사용할 입력 객체를 입력변수로 선언 =================================
    private Scanner scan = new Scanner(System.in);

    // 화면 구성 =================================

    //[1]
    //[1.1]
    //[1.2]
    //[1.3]
    //[1.4]
    //[2]
    //[2.1]
    //[2.2]
    //[2.3]
    //[2.4]
    //[3]
    //[3.1]
    //[3.2]
    //[3.3]
    //[3.4]
    //[4]
    //[4.1]
    //[4.2]
    //[4.3]
    //[4.4]
    //[5]
    //[5.1]
    //[5.2]
    //[5.3]
    //[5.4]

} //class end
